puts "Введите длины сторон треугольника"

info = gets.chomp.split(', ', 3)
a = info[0].to_i
b = info[1].to_i
c = info[2].to_i

if a ** 2 == ((b ** 2) + (c ** 2)) || b ** 2 == ( (a ** 2) + (c ** 2) ) || c ** 2 == ( (a ** 2) + (b ** 2))
  puts "Треугольник прямоугольный #{ " и равнобедренный" if a == b || b == c || c == a }"
else
  puts "Треугольник не прямоугольный#{ if a == b && b == c && c == a
                                         ", равносторонний"
                                       else
                                         if
                                         a == b || b == c || c == a
                                         " и равнобедренный"
                                         else
                                         end
                                       end }"
end

